eziya/STM32_SECURITY_LAB/MOOC_DOCS/Part6/STM32CubeExpansion_SBSFU_V2.6.1/Projects/P-NUCLEO-WB55.Nucleo/Applications/1_Image/1_Image_SBSFU/SBSFU/App/sfu_boot.c
/**
  ******************************************************************************
  * @file    sfu_boot.c
  * @author  MCD Application Team
  * @brief   SFU BOOT module
  *          This file provides firmware functions to manage the following
  *          functionalities of the Secure Boot:
  *           + Initialization and de-initialization functions
  *           + Secure Boot Control functions
  *           + Secure Boot State functions
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2017 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file in
  * the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

#define SFU_BOOT_C

/* Includes ------------------------------------------------------------------*/
#include "string.h"
#include "sfu_boot.h"
#include "sfu_loader.h"
#include "sfu_low_level_security.h"
#include "sfu_low_level_flash_int.h"
#include "sfu_low_level.h"
#include "sfu_fsm_states.h"
#include "sfu_error.h"
#include "stm32wbxx_it.h" /* required for the HAL Cube callbacks */
/*
 * The sfu_com init is provided by the sfu_com_trace module by default.
 * If not, then it is taken from the sfu_com_loader module.
 */
#if defined(SFU_DEBUG_MODE) || defined(SFU_TEST_PROTECTION)
#include "sfu_trace.h"
#else
#include "sfu_trace.h"      /* needed anyhow even if the defines will be empty */
#include "sfu_com_loader.h" /* needed only for the COM init/de-init */
#endif /* SFU_DEBUG_MODE  || SFU_TEST_PROTECTION */
#include "se_def.h"
#include "se_interface_bootloader.h"  /* sfu_boot is the bootloader core part */
#include "sfu_new_image.h"            /* the local loader is a kind of "application" running in SB_SFU so it needs the
                                         services to install a FW image */
#include "sfu_fwimg_services.h"       /* sfu_boot uses the services of the FWIMG module */
#include "sfu_test.h"                 /* auto tests */
#include "sfu_fwimg_internal.h"
#include "sfu_standalone_loader.h"


/* Private typedef -----------------------------------------------------------*/
typedef struct
{
  SFU_BOOT_StateMachineTypeDef  PrevState;      /*!< The previous state of the State Machine */
  SFU_BOOT_StateMachineTypeDef  CurrState;      /*!< The current state of the State Machine */
} SFU_BOOT_StateMachineContextTypeDef;          /*!< Specifies a structure containing the State Machine context
                                                     information using during the SM evolution. */

/* Private defines -----------------------------------------------------------*/
#define EXEC_ID_SECURE_BOOT     0U       /*!< ID for Secure Boot */
#define EXEC_ID_USER_APP        1U       /*!< ID for User App */
#define IS_VALID_EXEC_ID(EXEC_ID)        (((EXEC_ID) == EXEC_ID_SECURE_BOOT) || \
                                          ((EXEC_ID) == EXEC_ID_USER_APP)) /*!< Check for valid ID */

#define RESERVED_VALUE (0xFEU) /*!< Reserved value. The reserved field used inside the LastExecStatus of the BootInfo is
                                    maintained for future customization/expansion of the field itself */

#define SFU_STATE_INITIAL     SFU_STATE_CHECK_STATUS_ON_RESET  /*!< Define the initial state*/

/* Private macros ------------------------------------------------------------*/
#define SFU_SET_SM_IF_CURR_STATE(Status, SM_STATE_OK, SM_STATE_FAILURE) \
  do{                                                                   \
    m_StateMachineContext.PrevState = m_StateMachineContext.CurrState;  \
    if (Status == SFU_SUCCESS){                                         \
      m_StateMachineContext.CurrState = SM_STATE_OK;                    \
    }                                                                   \
    else {                                                              \
      m_StateMachineContext.CurrState = SM_STATE_FAILURE;               \
    }                                                                   \
  }while(0) /*!< Set a State Machine state according to the 'Status' value*/


#define SFU_SET_SM_CURR_STATE(NewState)                                 \
  do{                                                                   \
    m_StateMachineContext.PrevState = m_StateMachineContext.CurrState;  \
    m_StateMachineContext.CurrState = NewState;                         \
  }while(0) /*!< Set a State Machine state*/

/* Private variables ---------------------------------------------------------*/
/*!< Static member variables representing the StateMachine context used during the StateMachine evolution. */
static __IO SFU_BOOT_StateMachineContextTypeDef m_StateMachineContext = {SFU_STATE_INITIAL,
                                                                         SFU_STATE_INITIAL
                                                                        };

/*!< Static member variables identifyng the slots to be processed by secure firmware update . */
#if   (SECBOOT_LOADER == SECBOOT_USE_STANDALONE_LOADER)
static uint32_t m_DwlSlotToInstall = SLOT_INACTIVE;
#endif /* SECBOOT_LOADER == SECBOOT_USE_STANDALONE_LOADER */
static uint32_t m_ActiveSlotToExecute = SLOT_INACTIVE;

/* Global variables ----------------------------------------------------------*/
/**
  * This variable indicates if at boot-up the FW presence check has already been performed or not:
  * \li It is reset when the FW status has already been checked once and no FW is present
  * \li (see @ref SFU_BOOT_SM_CheckUserFwStatus)
  * \li It is used to display some messages only once in the teraterm console
  * \li It is used to determine if the user button must be pressed before waiting for a local download to start
  * \li This is used at LocalDownload and CheckUserFwStatus stages.
  */
uint8_t initialDeviceStatusCheck;

/**
  *  Flow control initial values.
  *   - Security protections flow (static + dynamic)
  *   - Crypto operations flow (authentication, integrity)
  */
uint32_t uFlowProtectValue = FLOW_CTRL_INIT_VALUE;
uint32_t uFlowCryptoValue = FLOW_CTRL_INIT_VALUE;

