eziya/STM32_SECURITY_LAB/MOOC_DOCS/Part6/STM32CubeExpansion_SBSFU_V2.6.1/Projects/P-NUCLEO-WB55.Nucleo/Applications/1_Image/1_Image_SBSFU/SBSFU/App/sfu_boot.c
#if (SECBOOT_LOADER == SECBOOT_USE_LOCAL_LOADER) || (SECBOOT_LOADER == SECBOOT_USE_STANDALONE_LOADER)
  /* User Button */
  BUTTON_INIT();
#endif /* (SECBOOT_LOADER == SECBOOT_USE_LOCAL_LOADER) || (SECBOOT_LOADER == SECBOOT_USE_STANDALONE_LOADER) */
}

/**
  * @brief  Execute the Secure Boot state machine.
  * @param  None
  * @retval SFU_ErrorStatus SFU_SUCCESS if successful, SFU_ERROR otherwise.
  */
static SFU_ErrorStatus SFU_BOOT_SM_Run(void)
{
  SFU_ErrorStatus  e_ret_status = SFU_SUCCESS;
  void (*fnStateMachineFunction)(void);
  static void (* fnStateMachineTable[])(void) = {SFU_BOOT_SM_CheckStatusOnReset,
#if (SECBOOT_LOADER == SECBOOT_USE_LOCAL_LOADER) || (SECBOOT_LOADER == SECBOOT_USE_STANDALONE_LOADER)
                                                 SFU_BOOT_SM_CheckNewFwToDownload,
                                                 SFU_BOOT_SM_DownloadNewUserFw,
#endif /* (SECBOOT_LOADER == SECBOOT_USE_LOCAL_LOADER) || (SECBOOT_LOADER == SECBOOT_USE_STANDALONE_LOADER) */
                                                 SFU_BOOT_SM_CheckUserFwStatus,
                                                 SFU_BOOT_SM_VerifyUserFwSignature,
                                                 SFU_BOOT_SM_ExecuteUserFw,
                                                 SFU_BOOT_SM_HandleCriticalFailure,
                                                 SFU_BOOT_SM_RebootStateMachine
                                                };

  /* Start the State Machine loop/evolution */
  while (e_ret_status == SFU_SUCCESS)
  {
    /* Always execute a security/safety check before moving to the next state */
    if (SFU_BOOT_SecuritySafetyCheck() == SFU_SUCCESS)
    {
      /* Get the right StateMachine function according to the current state */
      fnStateMachineFunction = fnStateMachineTable[(uint8_t)m_StateMachineContext.CurrState];

      /* Call the State Machine function associated to the current state */
      fnStateMachineFunction();
    }
    else
    {
      e_ret_status = SFU_ERROR;
    }
  }

  /* If the State Machine cannot evolve anymore, reboot is the only option */

  /* Set the error before forcing a reboot */
  SFU_EXCPT_SetError(SFU_EXCPT_UNKNOWN);

  /* This is the last operation executed. Force a System Reset */
  SFU_BOOT_ForceReboot();

  return e_ret_status;
}

/** @brief  Check the Reset status in order to understand the last cause of Reset
  * @param  None
  * @note   This function must set the next State Machine State
  * @retval None
  */
static void SFU_BOOT_SM_CheckStatusOnReset(void)
{
  TRACE("\r\n= [SBOOT] STATE: CHECK STATUS ON RESET");

  /* Check the wakeup sources */
  SFU_BOOT_ManageResetSources();


#if (SECBOOT_LOADER == SECBOOT_USE_LOCAL_LOADER) || (SECBOOT_LOADER == SECBOOT_USE_STANDALONE_LOADER)
  /* When the local loader feature is supported we need to check if a local download is requested */
  SFU_SET_SM_CURR_STATE(SFU_STATE_CHECK_NEW_FW_TO_DOWNLOAD);
#else
  /* When the local loader feature is disabled go directly to the check of the FW status */
  SFU_SET_SM_CURR_STATE(SFU_STATE_VERIFY_USER_FW_STATUS);
#endif /* (SECBOOT_LOADER == SECBOOT_USE_LOCAL_LOADER) || (SECBOOT_LOADER == SECBOOT_USE_STANDALONE_LOADER) */
}

#if (SECBOOT_LOADER == SECBOOT_USE_LOCAL_LOADER) || (SECBOOT_LOADER == SECBOOT_USE_STANDALONE_LOADER)
/**
  * @brief  Check if a new UserApp firmware is available for downloading.
  *         When entering this state from SFU_STATE_CHECK_STATUS_ON_RESET (initialDeviceStatusCheck=1) it is required
  *         to press the user button to force the local download.
  *         When entering this state from SFU_STATE_VERIFY_USER_FW_STATUS the local download is awaited automatically
  *         (because there is no other action to do).
  * @param  None
  * @note   This function must set the next State Machine State.
  * @retval None
  */
static void SFU_BOOT_SM_CheckNewFwToDownload(void)
{
  SFU_ErrorStatus  e_ret_status = SFU_ERROR;
#if (SECBOOT_LOADER == SECBOOT_USE_STANDALONE_LOADER)
  SE_StatusTypeDef e_se_status = SE_KO;

  /* Bypass mode ==> CM0 update process to be started / in progress */
  if (STANDALONE_LOADER_STATE == STANDALONE_LOADER_BYPASS_REQ)
  {
    TRACE("\r\n= [SBOOT] STATE: Bypass mode - execution CM0 update process");
    if (SE_CM0_Update(&e_se_status) == SE_SUCCESS)
    {
      TRACE("\r\n\t  CM0 update successful");
      e_ret_status = SFU_SUCCESS;
    }
    else
    {
      SFU_EXCPT_SetError(SFU_EXCPT_CM0_UPDATE_ERR);
      e_ret_status = SFU_ERROR;
    }

    SFU_BOOT_ForceReboot();
    return;
  }

  if (STANDALONE_LOADER_STATE == STANDALONE_LOADER_DWL_REQ)
  {
    TRACE("\r\n= [SBOOT] STATE: execution standalone loader");
    e_ret_status = SFU_BOOT_LaunchStandaloneLoader();

    /* This is unreachable code (dead code) in principle...
    At this point we should not be able to reach the following instructions.
    If we can execute them a critical issue has occurred.. So set the next State Machine accordingly */
    SFU_SET_SM_IF_CURR_STATE(e_ret_status, SFU_STATE_HANDLE_CRITICAL_FAILURE, SFU_STATE_HANDLE_CRITICAL_FAILURE);
    return;
  }
#endif /* (SECBOOT_LOADER == SECBOOT_USE_STANDALONE_LOADER) */

  if (initialDeviceStatusCheck == 1U)
  {
    /* At boot-up, before checking the FW status, a local download can be forced thanks to the user button */
    TRACE("\r\n= [SBOOT] STATE: CHECK NEW FIRMWARE TO DOWNLOAD");
    if (0U != BUTTON_PUSHED())
    {
      /* Download requested */
      e_ret_status = SFU_SUCCESS;
    }
    else
    {
      e_ret_status = SFU_ERROR;
    }
  }
  else
  {
    /*
     * The FW status has already been checked and no FW can be launched: no need to check the trigger, wait for a local
     * download to start
     */
    e_ret_status = SFU_SUCCESS;
  }

  /* Set the next State Machine state according to the success of the failure of e_ret_status */
  SFU_SET_SM_IF_CURR_STATE(e_ret_status, SFU_STATE_DOWNLOAD_NEW_USER_FW, SFU_STATE_VERIFY_USER_FW_STATUS);

}
#endif /* (SECBOOT_LOADER == SECBOOT_USE_LOCAL_LOADER) || (SECBOOT_LOADER == SECBOOT_USE_STANDALONE_LOADER) */


/**
  * @brief  Check the Status of the Fw Image to work on  in order to set the next
  *         State Machine state accordingly
  * @param  None
  * @note   This function must set the next State Machine State
  * @retval None
  */
static void SFU_BOOT_SM_CheckUserFwStatus(void)
{
#if (SECBOOT_LOADER == SECBOOT_USE_STANDALONE_LOADER)
  SFU_ErrorStatus e_ret_status = SFU_ERROR;
#endif /* (SECBOOT_LOADER == SECBOOT_USE_STANDALONE_LOADER) */
  uint32_t i;

