eziya/STM32_SECURITY_LAB/MOOC_DOCS/Part6/STM32CubeExpansion_SBSFU_V2.6.1/Projects/P-NUCLEO-WB55.Nucleo/Applications/1_Image/1_Image_SBSFU/SBSFU/App/sfu_boot.c
  if (initialDeviceStatusCheck == 1U)
  {
    TRACE("\r\n= [SBOOT] STATE: CHECK USER FW STATUS");
  }

#if (SECBOOT_LOADER == SECBOOT_USE_STANDALONE_LOADER)
  if (STANDALONE_LOADER_STATE == STANDALONE_LOADER_INSTALL_REQ)
  {
    /* Whatever the status the decryption can be done only once ==> no interruption allowed */
    STANDALONE_LOADER_STATE = STANDALONE_LOADER_NO_REQ;

    TRACE("\r\n\t  New Fw Encrypted, to be decrypted");

    /* Check if there is a pending action related to a FW update procedure */
    if (SFU_IMG_CheckPendingInstallation(&m_DwlSlotToInstall) == SFU_IMG_FWIMAGE_TO_INSTALL)
    {
      /* Check the candidate version vs current active version */
      e_ret_status = SFU_IMG_CheckCandidateVersion(m_DwlSlotToInstall);

      if (SFU_SUCCESS != e_ret_status)
      {
        /* Erase downloaded FW in case of authentication/integrity error */
        (void) SFU_IMG_EraseDownloadedImg(m_DwlSlotToInstall);
      }
      else
      {
        /* Secure coding : double check the candidate version vs current active version */
        e_ret_status = SFU_IMG_CheckCandidateVersion(m_DwlSlotToInstall);
      }

      if (SFU_SUCCESS == e_ret_status)
      {
        /* Start installation */
        e_ret_status = SFU_IMG_TriggerImageInstallation(m_DwlSlotToInstall);
      }
    }

    /* Critical failure management if installation failed */
    if (e_ret_status != SFU_SUCCESS)
    {
      SFU_SET_SM_CURR_STATE(SFU_STATE_HANDLE_CRITICAL_FAILURE);
      return;
    }
  }
#endif /* SECBOOT_LOADER == SECBOOT_USE_STANDALONE_LOADER */

  /*
   * No FW image installation pending :
   *   1- Priority to MASTER_SLOT : check if a firmware is detected
   *   2- No firmware identified : verify other slots and start execution on the last detected firmware
   *   3- No active firmware candidate for execution ==> Local download
   *
   * This strategy can be adapted by removing for example execution of step2 ==> focus only on MASTER_SLOT.
   */

  m_ActiveSlotToExecute = 0U;

  /* 1- Priority to MASTER_SLOT : check if a firmware is detected */
  if (MASTER_SLOT != 0xFFU)
  {
    if (SFU_SUCCESS == SFU_IMG_DetectFW(MASTER_SLOT))
    {
      m_ActiveSlotToExecute = MASTER_SLOT;
      TRACE("\r\n\t  A FW is detected in the slot SLOT_ACTIVE_%d", m_ActiveSlotToExecute);
      SFU_SET_SM_CURR_STATE(SFU_STATE_VERIFY_USER_FW_SIGNATURE);
    }
  }

  /* 2- No firmware identified : verify other slots and start execution on the last detected firmware */
  if (m_ActiveSlotToExecute == 0U)
  {
    for (i = 0U; i < SFU_NB_MAX_ACTIVE_IMAGE; i++)
    {
      if (SlotStartAdd[SLOT_ACTIVE_1 + i] != 0U)         /* Slot configured ? */
      {
        if (SFU_SUCCESS == SFU_IMG_DetectFW(SLOT_ACTIVE_1 + i))
        {
          m_ActiveSlotToExecute = SLOT_ACTIVE_1 + i;
          TRACE("\r\n\t  A FW is detected in the slot SLOT_ACTIVE_%d", m_ActiveSlotToExecute);
          SFU_SET_SM_CURR_STATE(SFU_STATE_VERIFY_USER_FW_SIGNATURE);
        }
      }
    }
  }

  /* 3- No active firmware candidate for execution ==> Local download */
  if (m_ActiveSlotToExecute == 0U)
  {
    /* Control if all active slot are empty */
    for (i = 0U; i < SFU_NB_MAX_ACTIVE_IMAGE; i++)
    {
      if (SlotStartAdd[SLOT_ACTIVE_1 + i] != 0U)       /* Slot configured ? */
      {
        if (SFU_IMG_VerifyEmptyActiveSlot(SLOT_ACTIVE_1 + i) != SFU_SUCCESS)
        {
          /*
           * We should never reach this code.
           * Could come from an attack ==> as an example we invalidate current firmware.
           */
          TRACE("\r\n\t  Slot SLOT_ACTIVE_%d not empty : erasing ...", SLOT_ACTIVE_1 + i);
          (void)SFU_IMG_InvalidateCurrentFirmware(SLOT_ACTIVE_1 + i); /* If this fails we continue anyhow */
        }
      }
    }

    /*
     * No valid FW is present in the active slot
     * and there is no FW to be installed in UserApp download area: local download (when possible)
     */
    if (initialDeviceStatusCheck == 1U)
    {
      TRACE("\r\n\t  No valid FW found in the active slots nor new FW to be installed");
#if (SECBOOT_LOADER == SECBOOT_USE_LOCAL_LOADER) || (SECBOOT_LOADER == SECBOOT_USE_STANDALONE_LOADER)
      /* Waiting for a local download is automatic, no trigger required. */
      TRACE("\r\n\t  Waiting for the local download to start... ");
#endif /* (SECBOOT_LOADER == SECBOOT_USE_LOCAL_LOADER) || (SECBOOT_LOADER == SECBOOT_USE_STANDALONE_LOADER) */
      initialDeviceStatusCheck = 0U;
#ifdef SFU_TEST_PROTECTION
      SFU_TEST_Reset();
#endif /* SFU_TEST_PROTECTION */
    }
#if defined(SFU_VERBOSE_DEBUG_MODE)
    else
    {
      /*
       * No ELSE branch (except for verbose debug), because the FW status is checked only once per boot:
       *   If a FW is present in the active slot => it is checked then launched.
       *   If there is a FW to install => the installation procedure starts.
       *   If no FW is present and no installation is pending:
       *      - if the local loader feature is enabled we enter the local download state
       *      - if the local loader feature is disabled, the execution is stopped.
       */
      TRACE("\r\n\t  Abnormal case: SFU_STATE_VERIFY_USER_FW_STATUS is not supposed to be entered more than once per boot.");
    }
#endif /* SFU_VERBOSE_DEBUG_MODE */
#if (SECBOOT_LOADER == SECBOOT_USE_LOCAL_LOADER) || (SECBOOT_LOADER == SECBOOT_USE_STANDALONE_LOADER)
    SFU_SET_SM_CURR_STATE(SFU_STATE_CHECK_NEW_FW_TO_DOWNLOAD);
#else
    /*
     * When the local loader feature is disabled it is not possible to enter the "check new fw download" state.
     * Rebooting automatically or keeping on checking the FW status would not necessarily be better.
     * So we end up waiting for the user to reboot (or the IWDG to expire).
     */
    TRACE("\r\n\t  No valid FW and no local loader: execution stopped.\r\n");
    while (1 == 1)
    {
      (void) BSP_LED_Toggle(SFU_STATUS_LED);
      HAL_Delay(SFU_STOP_NO_FW_BLINK_DELAY);
    }
#endif /* (SECBOOT_LOADER == SECBOOT_USE_LOCAL_LOADER) || (SECBOOT_LOADER == SECBOOT_USE_STANDALONE_LOADER) */
  }
}


#if (SECBOOT_LOADER == SECBOOT_USE_STANDALONE_LOADER)
/**
  * @brief  A new UserApp Fw was available. Start to download it
  * @param  None
  * @note   Reset is generated at by standalone loader when FW is downloaded.
  * @retval None
  */
static void SFU_BOOT_SM_DownloadNewUserFw(void)
{
  SFU_ErrorStatus e_ret_status = SFU_ERROR;

  TRACE("\r\n= [SBOOT] STATE: DOWNLOAD NEW USER FIRMWARE");

