eziya/STM32_SECURITY_LAB/MOOC_DOCS/Part6/STM32CubeExpansion_SBSFU_V2.6.1/Projects/P-NUCLEO-WB55.Nucleo/Applications/1_Image/1_Image_SBSFU/SBSFU/App/sfu_boot.c
  /* Jump into standalone loader */
  STANDALONE_LOADER_STATE = STANDALONE_LOADER_DWL_REQ;
  e_ret_status = SFU_BOOT_LaunchStandaloneLoader();

  /* This is unreachable code (dead code) in principle...
  At this point we should not be able to reach the following instructions.
  If we can execute them a critical issue has occurred.. So set the next State Machine accordingly */
  SFU_SET_SM_IF_CURR_STATE(e_ret_status, SFU_STATE_HANDLE_CRITICAL_FAILURE, SFU_STATE_HANDLE_CRITICAL_FAILURE);
}
#elif (SECBOOT_LOADER == SECBOOT_USE_LOCAL_LOADER)
/**
  * @brief  A new UserApp Fw was available. Start to download it
  * @param  None
  * @note   This function must set the next State Machine State
  * @retval None
  */
static void SFU_BOOT_SM_DownloadNewUserFw(void)
{
  SFU_ErrorStatus           e_ret_status = SFU_ERROR;
  SFU_LOADER_StatusTypeDef  e_ret_status_app = SFU_LOADER_ERR_COM;
  uint32_t                  dwl_slot;
  uint32_t                  u_size = 0;

  TRACE("\r\n= [SBOOT] STATE: DOWNLOAD NEW USER FIRMWARE");

  /*
   * Download area will be chosen as following. After header analysis :
   *   - same DWL slot number as SFU magic number, if the slot is configured.
   *     As example, we will choose SLOT_DWL_2 for SFU2 magic in the FW header
   *   - by default : SLOT_DWL_1
   */
  e_ret_status = SFU_LOADER_DownloadNewUserFw(&e_ret_status_app, &dwl_slot, &u_size);
  if (e_ret_status == SFU_SUCCESS)
  {
#if defined(SFU_VERBOSE_DEBUG_MODE)
    TRACE("\r\n\t  FwSize=%d | PartialFwSize=%d | PartialFwOffset=%d | %d bytes received",
          fw_image_header_validated.FwSize, fw_image_header_validated.PartialFwSize,
          fw_image_header_validated.PartialFwOffset, u_size);
#endif /* SFU_VERBOSE_DEBUG_MODE */

    /* Read header in dwl slot */
    e_ret_status = SFU_LL_FLASH_Read((uint8_t *) &fw_image_header_validated, (uint8_t *) SlotStartAdd[dwl_slot],
                                     sizeof(SE_FwRawHeaderTypeDef));
  }

  if (e_ret_status == SFU_SUCCESS)
  {
    /*
     * In 1_Image example : dwl_slot == active_slot
     */
    if (SFU_IMG_Validation(dwl_slot, &fw_image_header_validated) != SFU_SUCCESS)
    {
      /* CleanUp downloaded image (header preserved, for anti-rollback) */
      (void) SFU_IMG_InvalidateCurrentFirmware(dwl_slot);

      /* no specific error cause set */
#if defined(SFU_VERBOSE_DEBUG_MODE)
      TRACE("\r\n\t  Cannot memorize that a new image has been downloaded.");
#endif /* SFU_VERBOSE_DEBUG_MODE */
    }
  }
  else
  {
    /* CleanUp downloaded image (header preserved, for anti-rollback) */
    (void) SFU_IMG_InvalidateCurrentFirmware(dwl_slot);

    /* Memorize the specific error cause if any before handling this critical failure */
    switch (e_ret_status_app)
    {
      case SFU_LOADER_ERR_COM:
        SFU_EXCPT_SetError(SFU_EXCPT_COM_ERR);
        break;
      case SFU_LOADER_ERR_FW_VERSION:
        SFU_EXCPT_SetError(SFU_EXCPT_VERSION_ERR);
        break;
      case SFU_LOADER_ERR_FW_LENGTH:
        SFU_EXCPT_SetError(SFU_EXCPT_FW_TOO_BIG);
        break;
      case SFU_LOADER_ERR_AUTH_FAILED:
        SFU_EXCPT_SetError(SFU_EXCPT_HEADER_AUTH_ERR);
        break;
      case SFU_LOADER_ERR_FLASH:
        SFU_EXCPT_SetError(SFU_EXCPT_FLASH_ERR);
        break;
      case SFU_LOADER_ERR_CRYPTO:
        SFU_EXCPT_SetError(SFU_EXCPT_DECRYPT_ERR);
        break;
      default:
        /* no specific error cause */
        break;
    }
  } /* else error with no specific error cause */
  /* Set the next State Machine state according to the success of the failure of e_ret_status */
  SFU_SET_SM_IF_CURR_STATE(e_ret_status, SFU_STATE_REBOOT_STATE_MACHINE, SFU_STATE_HANDLE_CRITICAL_FAILURE);
}
#endif /* SECBOOT_LOADER == SECBOOT_USE_STANDALONE_LOADER */


/**
  * @brief  Verify the UserApp Fw signature before executing it
  * @param  None
  * @note   This function must set the next State Machine State
  * @retval None
  */
static void SFU_BOOT_SM_VerifyUserFwSignature(void)
{
  SFU_ErrorStatus e_ret_status = SFU_ERROR;
  uint32_t i;

  TRACE("\r\n= [SBOOT] STATE: VERIFY USER FW SIGNATURE");

  /* Double security check :
     - testing "static protections" twice will avoid basic hardware attack
     - flow control reached : dynamic protections checked
     - re-execute static then dynamic check
     - errors caught by FLOW_CONTROL ==> infinite loop */
  FLOW_CONTROL_CHECK(uFlowProtectValue, FLOW_CTRL_RUNTIME_PROTECT);
  FLOW_CONTROL_INIT(uFlowProtectValue, FLOW_CTRL_INIT_VALUE);
  e_ret_status = SFU_LL_SECU_CheckApplyStaticProtections();
  FLOW_CONTROL_CHECK(uFlowProtectValue, FLOW_CTRL_STATIC_PROTECT);
  if (e_ret_status == SFU_SUCCESS)
  {
    e_ret_status = SFU_LL_SECU_CheckApplyRuntimeProtections(SFU_THIRD_CONFIGURATION);
  }
  FLOW_CONTROL_CHECK(uFlowProtectValue, FLOW_CTRL_RUNTIME_PROTECT);
  if (e_ret_status != SFU_SUCCESS)
  {
    /*
     * Due to previous flow control, we should never reach this code  :
     * Critical failure management if installation failed
     */
    SFU_SET_SM_CURR_STATE(SFU_STATE_HANDLE_CRITICAL_FAILURE);
    return;
  }

  /*
   * With the 2 images handling:
   *       1. the header signature is verified  when installing a new firmware
   *       2. the firmware signature is checked when installing a new firmware
   *       3. remaining part of active slot is kept "clean" during installation procedure
   * So following checks should never fail.
   */
  /* Check all active slots configured */
  for (i = 0U; i < SFU_NB_MAX_ACTIVE_IMAGE; i++)
  {
    /* Slot configured ? */
    if (SlotStartAdd[SLOT_ACTIVE_1 + i] != 0U)
    {
      /* FW installed ? */
      if (SFU_SUCCESS == SFU_IMG_DetectFW(SLOT_ACTIVE_1 + i))
      {
        /* Initialize Flow control */
        FLOW_CONTROL_INIT(uFlowCryptoValue, FLOW_CTRL_INIT_VALUE);

        /* Check the header signature */
        e_ret_status = SFU_IMG_VerifyActiveImgMetadata(SLOT_ACTIVE_1 + i);
        if (SFU_SUCCESS == e_ret_status)
        {
          /* Check the FW signature */
          e_ret_status = SFU_IMG_VerifyActiveImg(SLOT_ACTIVE_1 + i);
          if (SFU_SUCCESS == e_ret_status)
          {
            /* Verify that there is no additional code beyond firmware image */
            e_ret_status = SFU_IMG_VerifyActiveSlot(SLOT_ACTIVE_1 + i);
            if (SFU_SUCCESS != e_ret_status)
            {
#if defined(SFU_VERBOSE_DEBUG_MODE)
              TRACE("\r\n\t  Unexpected code beyond FW image in slot SLOT_ACTIVE_%d", SLOT_ACTIVE_1 + i);
#endif /* SFU_VERBOSE_DEBUG_MODE */
            }
          }
          else
          {
#if defined(SFU_VERBOSE_DEBUG_MODE)
            TRACE("\r\n\t  Firmware signature verification failure in slot SLOT_ACTIVE_%d", SLOT_ACTIVE_1 + i);
#endif /* SFU_VERBOSE_DEBUG_MODE */
          }
        }
        else
        {
#if defined(SFU_VERBOSE_DEBUG_MODE)
          TRACE("\r\n\t  Header signature verification failure in slot SLOT_ACTIVE_%d", SLOT_ACTIVE_1 + i);
#endif /* SFU_VERBOSE_DEBUG_MODE */
        }
        /*
         * One of the checks fails :
         *  - Header signature
         *  - FW signature
         *  - No malicious code
         *  ==> Active slot should be invalidated
         */
        if (SFU_SUCCESS != e_ret_status)
        {
          /*
           * We should never reach this code.
           * Could come from an attack ==> as an example we invalidate current firmware.
           */
#if defined(SFU_VERBOSE_DEBUG_MODE)
          TRACE("\r\n\t  Erasing slot SLOT_ACTIVE_%d", SLOT_ACTIVE_1 + i);
#endif /* SFU_VERBOSE_DEBUG_MODE */
          (void)SFU_IMG_InvalidateCurrentFirmware(SLOT_ACTIVE_1 + i); /* If this fails we continue anyhow */
        }
        else
        {
          /* Verify if authentication and integrity controls performed */
          FLOW_CONTROL_CHECK(uFlowCryptoValue, FLOW_CTRL_INTEGRITY);
        }
      }
      else
      {
        if (SFU_IMG_VerifyEmptyActiveSlot(SLOT_ACTIVE_1 + i) != SFU_SUCCESS)
        {
          /*
           * We should never reach this code.
           * Could come from an attack ==> as an example we invalidate current firmware.
           */
#if defined(SFU_VERBOSE_DEBUG_MODE)
          TRACE("\r\n\t  Slot SLOT_ACTIVE_%d not empty : erasing ...", SLOT_ACTIVE_1 + i);
#endif /* SFU_VERBOSE_DEBUG_MODE */
          (void)SFU_IMG_InvalidateCurrentFirmware(SLOT_ACTIVE_1 + i); /* If this fails we continue anyhow */
        }
      }
    }
  }

  /* Set the next State Machine state according to the success of the failure of e_ret_status */
  SFU_SET_SM_IF_CURR_STATE(e_ret_status, SFU_STATE_EXECUTE_USER_FW, SFU_STATE_HANDLE_CRITICAL_FAILURE);
}

/**
  * @brief  Exit from the SB/SFU State Machine and try to execute the UserApp Fw
  * @param  None
  * @note   This function must set the next State Machine State
  * @retval None
  */
static void SFU_BOOT_SM_ExecuteUserFw(void)
{
  SFU_ErrorStatus e_ret_status = SFU_ERROR;
  SE_StatusTypeDef e_se_status = SE_KO;
  uint32_t i;

  TRACE("\r\n= [SBOOT] STATE: EXECUTE USER FIRMWARE");

  /* Reload Watchdog */
  (void) SFU_LL_SECU_IWDG_Refresh();

  /* Verify if authentication and integrity controls performed at SFU_STATE_VERIFY_USER_FW_SIGNATURE */
  FLOW_CONTROL_CHECK(uFlowCryptoValue, FLOW_CTRL_INTEGRITY);

  /* Double security check for all active slots :
     - Control twice the Header signature will avoid basic hardware attack
     - Control twice the FW signature will avoid basic hardware attack */

  /* Check all active slots configured */
  for (i = 0U; i < SFU_NB_MAX_ACTIVE_IMAGE; i++)
  {
    /* Slot configured ? */
    if (SlotStartAdd[SLOT_ACTIVE_1 + i] != 0U)
    {
      /* FW installed ? */
      if (SFU_SUCCESS == SFU_IMG_DetectFW(SLOT_ACTIVE_1 + i))
      {
        /* Initialize Flow control */
        FLOW_CONTROL_INIT(uFlowCryptoValue, FLOW_CTRL_INIT_VALUE);

